<html>
<head>
    <title>Лабораторна робота 01</title>
</head>
<body>
<h2>Lab_01</h2>
<h3>Task 2</h3>
<?php
// Задані катети a і b
$a = 3;
$b = 4;

// Знаходимо довжину гіпотенузи за теоремою Піфагора
$c = sqrt($a * $a + $b * $b);

// Обчислюємо об'єм циліндра
$volume = M_PI * $a * $b * $c;

// Виводимо результат
echo "Довжина гіпотенузи трикутника: $c<br>";
echo "Об'єм тіла, утвореного обертанням прямокутного трикутника з катетами $a і $b навколо гіпотенузи, становить: $volume";
?>
</body>
</html>